Словарь/src/InformationRegisters/ПарыНеДублей/ПарыНеДублей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПарыНеДублей</name>
  <dimensions>
    <name>Элемент1</name>
    <type>
      <types>CatalogRef.Словарь</types>
      <types>CatalogRef.Канджи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Элемент2</name>
    <type>
      <types>CatalogRef.Словарь</types>
      <types>CatalogRef.Канджи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Словарь/src/CommonModules/РаботаСДублямиВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Поиск дублей.
// 
// Параметры:
//  ПараметрыРаботыСДублями - Структура - См. Шаблон_ПараметрыРаботыСДублями()
// 
// Возвращаемое значение:
//  Структура - Поиск дублей:
// * ЕстьДубли - Булево - Истина если найдены дубли
// * ИнформацияОДублях - Строка - информация о дублях
Функция ПоискДублей(ПараметрыРаботыСДублями) Экспорт
	
	Результат = Шаблон_ИнформацияОДублях();
	Запрос = Новый Запрос;
	Запрос.Текст = ПараметрыРаботыСДублями.ТекстЗапросаПоискДублей;
	Для Каждого ПараметрЗапроса Из ПараметрыРаботыСДублями.ПараметрыЗапросаПоискДублей Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДублей = РезультатЗапроса.Выгрузить();
	
	ТаблицаДублей = ОтфильтрованнаяТаблицаДублей(ТаблицаДублей, ПараметрыРаботыСДублями.ПроверяемыйОбъект);
	
	Если ТаблицаДублей.Количество() > 0 Тогда
		Результат.ЕстьДубли = Истина;
		Результат.ИнформацияОДублях = 
			ПоместитьВоВременноеХранилище(ТаблицаДублей, ПараметрыРаботыСДублями.УникальныйИдентификаторФормы);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Шаблон информация о дублях.
// 
// Возвращаемое значение:
//  Структура - Шаблон информация о дублях:
// * ЕстьДубли - Булево - Истина если найдены дубли
// * ИнформацияОДублях - Строка - информация о дублях
Функция Шаблон_ИнформацияОДублях() Экспорт
	
	Возврат РаботаСДублямиСервер.Шаблон_ИнформацияОДублях();
	
КонецФункции

// Шаблон параметры работы с дублями.
// 
// Возвращаемое значение:
//  Структура - Шаблон параметры работы с дублями:
// * ИмяГруппыДубли - Строка - имя элемента формы в котором размещаются элементы управления
// * ПодписьДубля - Строка - надпись на форму
// * ТекстЗапросаПоискДублей - Строка - текст запроса для поиска дублей, в запросе должно быть выбрано поле Ссылка
// * ПараметрыЗапросаПоискДублей - Структура - параметры запроса, ключ = имя параметра, значение = значение
// * ПроверяемыйОбъект - Неопределено, ЛюбаяСсылка - заполняется если проверяемый элемент уже записан в базу
Функция Шаблон_ПараметрыРаботыСДублями() Экспорт
	
	Возврат РаботаСДублямиСервер.Шаблон_ПараметрыРаботыСДублями();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтфильтрованнаяТаблицаДублей(ТаблицаДублей, ПроверяемыйОбъект)
		
	Если НЕ ЗначениеЗаполнено(ПроверяемыйОбъект) Тогда
		Возврат ТаблицаДублей;
	КонецЕсли;
	
	// Если нет колонки "Ссылка", то жее
	Если ТаблицаДублей.Колонки.Найти("Ссылка") = Неопределено Тогда
		Возврат ТаблицаДублей;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОтфильтрованнаяТаблицаДублей();
	Запрос.УстановитьПараметр("ПроверяемыйОбъект", ПроверяемыйОбъект);
	Запрос.УстановитьПараметр("ТаблицаДублей", ТаблицаДублей);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Текст запроса отфильтрованная таблица дублей
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаОтфильтрованнаяТаблицаДублей()
	
	Возврат
	"ВЫБРАТЬ *
	|ПОМЕСТИТЬ ВТ_ТаблицаДублей
	|ИЗ
	|	&ТаблицаДублей КАК ТаблицаДублей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДублей.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Исключить
	|ИЗ
	|	ВТ_ТаблицаДублей КАК ВТ_ТаблицаДублей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПарыНеДублей КАК ПарыНеДублей
	|		ПО ВТ_ТаблицаДублей.Ссылка = ПарыНеДублей.Элемент1
	|		И ПарыНеДублей.Элемент2 = &ПроверяемыйОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДублей.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ТаблицаДублей КАК ВТ_ТаблицаДублей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПарыНеДублей КАК ПарыНеДублей
	|		ПО ВТ_ТаблицаДублей.Ссылка = ПарыНеДублей.Элемент2
	|		И ПарыНеДублей.Элемент1 = &ПроверяемыйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ *
	|ИЗ
	|	ВТ_ТаблицаДублей КАК ВТ_ТаблицаДублей
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Исключить КАК ВТ_Исключить
	|		ПО ВТ_ТаблицаДублей.Ссылка = ВТ_Исключить.Ссылка
	|ГДЕ
	|	ВТ_Исключить.Ссылка ЕСТЬ NULL";
	
КонецФункции
#КонецОбласти
